# coding=utf-8

index2label = {0: '原告是否适格',
               1: '原告专利是否有效',
               2: '被告有无生产/销售/许诺销售被诉侵权产品行为',
               3: '非生产经营目的抗辩',
               4: '现有技术或现有设计抗辩',
               5: '权利用尽抗辩',
               6: '先用权抗辩',
               7: '临时过境抗辩',
               8: '科研及实验目的抗辩',
               9: '医药行政审批抗辩',
               10: '权利懈怠抗辩',
               11: '合法来源抗辩',
               12: '禁止反悔抗辩',
               13: '滥用专利权抗辩',
               14: '侵权产品是否落入涉案专利保护范围',
               15: '被告应当承担何种民事责任',
               16: '起诉是否已过诉讼时效',
               17: '关于本案是否应中止审理',
               18: '原告是否构成重复起诉',
               19: '被告主体是否适格'}

label2index = {v: k for k, v in index2label.items()}
